OF_article_cases/2DCylinderUniformGranularFlow/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
 (
       alpha
        {
        field alpha.a; //field to initialise
        fields
        (
        z alpha
        );
        lookuptables (
        {
        name inletprofilealpha;
        outOfBounds clamp;
        file "$FOAM_CASE/profile_1d_profil/alpha.aNew.xy";
        }
        );
        expression "inletprofilealpha(pos().y+0.0443)";
        keepPatches 1;
        }
 );
